[
  {
    "path": "posts/2018-09-05-nvidia-rtx/",
    "title": "NVIDIA RTX™ : More For AI, Less For Games",
    "description": "NVIDIA® introduced a new graphics platform called NVIDIA RTX™. It promises extraordinary visuals with the help of new light computing technology.",
    "author": [
      {
        "name": "Serkan Altuntaş",
        "url": "https://serkan.gen.tr/"
      }
    ],
    "date": "2018-09-05",
    "categories": [],
    "contents": "\nNVIDIA® introduced a new graphics platform called NVIDIA RTX™. It promises extraordinary visuals with the help of new light computing technology.\nI am not a hardcore gamer, but at least I own a game console and would like to experience beautiful game graphics. I do not think the new Ray-tracing technology is a very critical entertainment factor for current games and most probably it will not be very crucial either. Until somebody invents a novel gameplay scenario that takes advantage of Ray-tracing, RTX is not more than a powerful GTX for games.\nWhile announcing, NVIDIA did not make the mistake of Microsoft®. On the reveal event of XBOX ONE™, Microsoft pushed none-gaming applications. But for a successful game console, you have to appeal gamers first. That is why NVIDIA should always talk about game technology first and not spend much time on boring stuff.\nAlmost all types of GPUs can be used to train deep learning models. NVIDIA is more preferred thanks to the CUDA® platform. CUDA accelerates computation exponentially for classic algebraic computations. It makes ordinary graphics computing units useful for tasks other than graphics. But now, with Quadro® series of RTX platform, NVIDIA advertised the Tensor cores.\nI think we owe Google® a thank you. Google’s invention of Tensor Processing Units (TPUs) accelerated the tensor computation race for NVIDIA. Google’s TensorFlow™ deep learning framework and many others need high-performance computing hardware for critical tasks. RTX platform will be the commodity hardware solution for independent scientists and engineers, since the Google’s TPUs are unavailable for sale.\nKeeping a very efficient computing power in hand is very important if you are working on deep learning projects. That is why, the new RTX platform will play a crucial role for developers, more than gamers. I hope AMD® will spend more time on tensor processing than Ray-tracing while answering NVIDIA’s call.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-10T01:47:21+03:00",
    "input_file": {}
  }
]
